# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
#brew 'awscli'
brew 'balena-cli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
#brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
#brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew 'stripe/stripe-cli/stripe'
#brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
#brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
#brew 'jpegoptim'
#brew 'optipng'
#brew 'pngquant'
#brew 'svgo'
#brew 'gifsicle'

# Development
#brew 'php'
#brew 'php@7.4'
#brew 'php@7.3'
#brew 'composer'
#brew 'imagemagick'
#brew 'libmemcached'
#brew 'meilisearch'
#brew 'memcached'
#brew 'mysql'
#brew 'nginx'
brew 'node'
#brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
#cask 'aerial'
cask 'alfred'
cask 'alt-c'
cask 'authy'
cask 'balenaetcher'
#cask 'caffeine'
#cask 'dbngin'
#cask 'discord'
cask 'docker'
cask 'dropbox'
#cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-earth-pro'
cask 'gpg-suite'
#cask 'imageoptim'
#cask 'insomnia'
cask 'kaleidoscope'
cask 'notion'
cask 'nzbvortex'
#cask 'phpmon'
#cask 'phpstorm'
cask 'plex'
cask 'postman'
#cask 'ray'
#cask 'screenflow'
cask 'sequel-pro'
cask 'serial'
#cask 'signal'
cask 'slack'
cask 'sourcetree'
cask 'skype'
cask 'spotify'
cask 'sublime-text'
cask 'subtitles'
#cask 'tableplus'
cask 'teamviewer'
cask 'telegram-desktop'
cask 'the-unarchiver'
#cask 'tinkerwell'
cask 'tnef'
cask 'tnefs-enough'
cask 'transmission'
#cask 'transmit'
#cask 'tunnelbear'
cask 'tunnelblick'
#cask 'tuple'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-fusion'
cask 'webex'
cask 'whatsapp'
cask 'nrlquaker-winbox'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'suspicious-package'
cask 'qlvideo'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-montserrat'

# Mac App Store
#mas 'Byword', id: 420212497
#mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
#mas 'Things', id: 904280696
#mas 'Tweetbot', id: 1384080005
mas 'Webcam Settings', id:533696630
mas 'Magnet', id:441258766
mas 'eDrawings', id:1209754386
mas 'SubShifter: Sync subtitles', id:1457012736
mas 'WireGuard', id:1451685025
mas 'Evernote', id:406056744
mas 'Todoist: To-Do List & Tasks', id:585829637
mas 'LastPass Password Manager', id:926036361


## other apps, for manual install:
# Kaleidoscope
# MS Office
# Adobe CC
# Name Mangler
# Transmit
# Unizmaker

## remaining todos:
# install Serial license
# install Subtitles license
# wire
